## Lahman sqlite exercise:

In [66]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("lahman.sqlite")
query = "SELECT * FROM sqlite_master;"

df_schema = pd.read_sql_query(query, conn)
df_schema.tbl_name.unique()

array(['allstarfull', 'appearances', 'awardsmanagers', 'awardsplayers',
       'awardssharemanagers', 'awardsshareplayers', 'batting',
       'battingpost', 'collegeplaying', 'divisions', 'fielding',
       'fieldingof', 'fieldingofsplit', 'fieldingpost', 'halloffame',
       'homegames', 'leagues', 'managers', 'managershalf', 'parks',
       'people', 'pitching', 'pitchingpost', 'salaries', 'schools',
       'seriespost', 'teams', 'teamsfranchises', 'teamshalf'],
      dtype=object)

### Function to to get columns in a table:

In [67]:
def table_columns(conn, table_name):
    cur = conn.cursor()
    sql = "select * from %s where 1=0;" % table_name
    cur.execute(sql)
    #cursor.description is column description
    return [d[0] for d in cur.description]

In [68]:
table_columns(conn, "salaries")

['ID', 'yearID', 'teamID', 'team_ID', 'lgID', 'playerID', 'salary']

#### 1. Waht was the total spent on salaries by each team, each year?

In [69]:
#define function to look at the first few row in the table
def peek_at_table(conn, table_name):
    cur = conn.cursor()
    cur.execute("SELECT * FROM %s;" %table_name)
    rows = cur.fetchmany(6)

    for row in rows[:6]:
        print(row)

In [70]:
#peek at the first few rows in the salaries table
peek_at_table(conn, "salaries")

(1, 1985, 'ATL', 1918, 'NL', 'barkele01', 870000.0)
(2, 1985, 'ATL', 1918, 'NL', 'bedrost01', 550000.0)
(3, 1985, 'ATL', 1918, 'NL', 'benedbr01', 545000.0)
(4, 1985, 'ATL', 1918, 'NL', 'campri01', 633333.0)
(5, 1985, 'ATL', 1918, 'NL', 'ceronri01', 625000.0)
(6, 1985, 'ATL', 1918, 'NL', 'chambch01', 800000.0)

In [71]:
#query to answer question 1
def team_salaries(conn):
    cur = conn.cursor()
    
    query = """SELECT teamID, team_ID, SUM(salary) 
               FROM salaries
               GROUP BY teamID, yearID;"""
    cur.execute(query)
    team_salaries = cur.fetchall()
    
    return pd.DataFrame(team_salaries)

In [72]:
team_salaries(conn).head()

     0     1           2
0  ATL  1918  14807000.0
1  BAL  1919  11560712.0
2  BOS  1920  10897560.0
3  CAL  1921  14427894.0
4  CHA  1922   9846178.0

#### 2. What is the first and last year played for each player?

In [73]:
#look at the columns in the fielding table
table_columns(conn, "fielding")

['ID',
 'playerID',
 'yearID',
 'stint',
 'teamID',
 'team_ID',
 'lgID',
 'POS',
 'G',
 'GS',
 'InnOuts',
 'PO',
 'A',
 'E',
 'DP',
 'PB',
 'WP',
 'SB',
 'CS',
 'ZR']

In [74]:
#peek at the first few rows in the fielding table
peek_at_table(conn, "fielding")

(1, 'abercda01', 1871, 1, 'TRO', 8, 'NA', 'SS', 1, 1, 24, 1, 3, 2, 0, None, None, None, None, None)
(2, 'addybo01', 1871, 1, 'RC1', 7, 'NA', '2B', 22, 22, 606, 67, 72, 42, 5, None, None, None, None, None)
(3, 'addybo01', 1871, 1, 'RC1', 7, 'NA', 'SS', 3, 3, 96, 8, 14, 7, 0, None, None, None, None, None)
(4, 'allisar01', 1871, 1, 'CL1', 3, 'NA', '2B', 2, 0, 18, 1, 4, 0, 0, None, None, None, None, None)
(5, 'allisar01', 1871, 1, 'CL1', 3, 'NA', 'OF', 29, 29, 729, 51, 3, 7, 1, None, None, None, None, None)
(6, 'allisdo01', 1871, 1, 'WS3', 9, 'NA', 'C', 27, 27, 681, 68, 15, 20, 4, 18, None, 0, 0, None)

In [75]:
#query to answer question 2
def years_played(conn):
    cur = conn.cursor()
    
    query = """SELECT playerID, MIN(yearID) AS first_year, MAX(yearID) AS last_year
               FROM fielding
               GROUP BY playerID;"""
    cur.execute(query)
    years_played = cur.fetchall()
    
    return pd.DataFrame(years_played)

In [76]:
years_played(conn).head()

           0     1     2
0  aardsda01  2004  2015
1  aaronha01  1954  1976
2  aaronto01  1962  1971
3   aasedo01  1977  1990
4   abadan01  2001  2003

#### 3. Who has played the most all star games?

In [77]:
#look at the columns in the allstarfull table
table_columns(conn, "allstarfull")

['ID',
 'playerID',
 'yearID',
 'gameNum',
 'gameID',
 'teamID',
 'team_ID',
 'lgID',
 'GP',
 'startingPos']

In [78]:
#peek at the first few rows in the allstarfull table
peek_at_table(conn, "allstarfull")

(1, 'gomezle01', 1933, 0, 'ALS193307060', 'NYA', 921, 'AL', 1, 1)
(2, 'ferreri01', 1933, 0, 'ALS193307060', 'BOS', 912, 'AL', 1, 2)
(3, 'gehrilo01', 1933, 0, 'ALS193307060', 'NYA', 921, 'AL', 1, 3)
(4, 'gehrich01', 1933, 0, 'ALS193307060', 'DET', 919, 'AL', 1, 4)
(5, 'dykesji01', 1933, 0, 'ALS193307060', 'CHA', 915, 'AL', 1, 5)
(6, 'cronijo01', 1933, 0, 'ALS193307060', 'WS1', 927, 'AL', 1, 6)

In [79]:
#query to answer question 3
def allstar_games(conn):
    cur = conn.cursor()
    
    query = """SELECT playerID, COUNT(gameID) AS game_num
               FROM allstarfull
               GROUP BY playerID
               ORDER BY game_num DESC;"""
    cur.execute(query)
    allstar_games = cur.fetchall()
    
    return pd.DataFrame(allstar_games)

In [80]:
allstar_games(conn).head()

           0   1
0  aaronha01  24
1   mayswi01  24
2  musiast01  24
3  mantlmi01  19
4  ripkeca01  19

#### 4. Which school has generated the most distinct players?

In [81]:
#look at the columns in the collegeplaying table
table_columns(conn, "collegeplaying")

['ID', 'playerID', 'schoolID', 'yearID']

In [82]:
#peek at the first few rows in the collegeplaying table
peek_at_table(conn, "collegeplaying")

(1, 'aardsda01', 'pennst', 2001)
(2, 'aardsda01', 'rice', 2002)
(3, 'aardsda01', 'rice', 2003)
(4, 'abadan01', 'gamiddl', 1992)
(5, 'abadan01', 'gamiddl', 1993)
(6, 'abbeybe01', 'vermont', 1889)

In [83]:
#query to answer question 4
def school_players(conn):
    cur = conn.cursor()
    
    query = """SELECT schoolID, COUNT(DISTINCT(playerID)) AS player_num
               FROM collegeplaying
               GROUP BY schoolID
               ORDER BY player_num DESC;"""
    cur.execute(query)
    school_players = cur.fetchall()
    
    return pd.DataFrame(school_players)

In [84]:
school_players(conn).head()

           0    1
0      texas  107
1        usc  105
2  arizonast  101
3   stanford   86
4   michigan   76

#### 5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career.

In [85]:
#look at the columns in the people table (question 5 mention master table, but no such table...T.T)
table_columns(conn, "people")

['playerID',
 'birthYear',
 'birthMonth',
 'birthDay',
 'birthCountry',
 'birthState',
 'birthCity',
 'deathYear',
 'deathMonth',
 'deathDay',
 'deathCountry',
 'deathState',
 'deathCity',
 'nameFirst',
 'nameLast',
 'nameGiven',
 'weight',
 'height',
 'bats',
 'throws',
 'debut',
 'finalGame',
 'retroID',
 'bbrefID',
 'birth_date',
 'debut_date',
 'finalgame_date',
 'death_date']

In [86]:
#peek at the first few rows in the people table
peek_at_table(conn, "people")

('aardsda01', 1981, 12, 27, 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215, 75, 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01', '1981-12-27', '2004-04-06', '2015-08-23', None)
('aaronha01', 1934, 2, 5, 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180, 72, 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01', '1934-02-05', '1954-04-13', '1976-10-03', None)
('aaronto01', 1939, 8, 5, 'USA', 'AL', 'Mobile', 1984, 8, 16, 'USA', 'GA', 'Atlanta', 'Tommie', 'Aaron', 'Tommie Lee', 190, 75, 'R', 'R', '1962-04-10', '1971-09-26', 'aarot101', 'aaronto01', '1939-08-05', '1962-04-10', '1971-09-26', '1984-08-16')
('aasedo01', 1954, 9, 8, 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190, 75, 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01', '1954-09-08', '1977-07-26', '1990-10-03', None)
('abadan01', 1972, 8, 25, 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184, 73, 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01', '1972-08-25', '2001-09-10', '2006-04-13', None)
('abadfe01', 1985, 12, 17, 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 220, 73, 'L', 'L', '2010-07-28', '2019-09-28', 'abadf001', 'abadfe01', '1985-12-17', '2010-07-28', '2019-09-28', None)

In [87]:
#query to answer question 5
def long_career(conn):
    cur = conn.cursor()
    
    query = """SELECT playerID, nameFirst, nameLast, debut, finalGame, 
                      (DATE(finalGame) - DATE(debut)) as duration
               FROM people
               ORDER BY duration DESC;"""
    cur.execute(query)
    long_career = cur.fetchall()
    
    return pd.DataFrame(long_career)

In [88]:
long_career(conn).head()

           0        1         2           3           4     5
0  altroni01     Nick   Altrock  1898-07-14  1933-10-01  35.0
1  orourji01      Jim  O'Rourke  1872-04-26  1904-09-22  32.0
2  minosmi01   Minnie    Minoso  1949-04-19  1980-10-05  31.0
3  olearch01  Charley   O'Leary  1904-04-14  1934-09-30  30.0
4  lathaar01    Arlie    Latham  1880-07-05  1909-09-30  29.0

#### 6. What is the distribution of debut months?

In [ ]:
#query to answer question 6
def debut_month(conn):
    cur = conn.cursor()
    
    query = """SELECT COUNT(debut), STRFTIME('%m', debut) AS month
               FROM people
               GROUP BY month;"""
    cur.execute(query)
    debut_month = cur.fetchall()
    
    return pd.DataFrame(debut_month)

In [ ]:
debut_month(conn)

#### 7. What is the effect of table join order on mean salary for the players listed in the main (master) table?

In [ ]:
#look at the columns in the salaries table
table_columns(conn, "salaries")

In [ ]:
#query to answer question 7
def mean_salary(conn):
    cur = conn.cursor()
    
    query = """SELECT p.nameFirst, p.nameLast, AVG(s.salary)
               FROM people p
               LEFT JOIN salaries s
               ON p.playerID = s.playerID
               GROUP BY p.playerID;"""
    cur.execute(query)
    mean_salary = cur.fetchall()
    
    return pd.DataFrame(mean_salary)

In [ ]:
mean_salary(conn)

## Soccer sqlite exercise:

In [ ]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('database.sqlite')

query = "SELECT * FROM sqlite_master"

df_schema = pd.read_sql_query(query, conn)

df_schema.tbl_name.unique()

#### 1. Which team scored the most points when playing at home?

In [ ]:
#look at the columns in the team table
table_columns(conn, "Team")

In [ ]:
#look at the columns in the match table
table_columns(conn, "Match")

In [ ]:
peek_at_table(conn, "Team")

In [ ]:
#query to answer question 1
def home_most(conn):
    cur = conn.cursor()
    
    query = """SELECT t.team_long_name, SUM(m.home_team_goal) AS total
               FROM Team t
               INNER JOIN Match m
               ON t.team_api_id = m.home_team_api_id
               GROUP BY m.home_team_api_id
               ORDER BY total DESC;"""
    cur.execute(query)
    home_most = cur.fetchall()
    
    return pd.DataFrame(home_most)

In [ ]:
home_most(conn).head()

#### 2. Did this team also score the most points when playing away?

In [ ]:
#query to answer question 2
def away_most(conn):
    cur = conn.cursor()
    
    query = """SELECT t.team_long_name, SUM(m.away_team_goal) AS total
               FROM Team t
               INNER JOIN Match m
               ON t.team_api_id = m.away_team_api_id
               GROUP BY m.away_team_api_id
               ORDER BY total DESC;"""
    cur.execute(query)
    away_most = cur.fetchall()
    
    return pd.DataFrame(away_most)

In [ ]:
away_most(conn).head()

#### 3. How many matches resulted in a tie?

In [ ]:
#query to answer question 3
def ties(conn):
    cur = conn.cursor()
    
    query = """SELECT COUNT(match_api_id)
               FROM Match 
               WHERE home_team_goal == away_team_goal;"""
    cur.execute(query)
    ties = cur.fetchall()
    
    return pd.DataFrame(ties)

In [ ]:
ties(conn)

#### 4. How many players have Smith for their last name? How many have 'smith' anywhere in their name?

In [ ]:
#look at the columns in the player table
table_columns(conn, "Player")

In [ ]:
#look at the first few rows in the player table
peek_at_table(conn, "Player")

In [ ]:
#query to answer question 4 part 1
def last_name_Smith(conn):
    cur = conn.cursor()
    
    query = """SELECT COUNT(*)
               FROM Player 
               WHERE player_name LIKE '% Smith';"""
    cur.execute(query)
    last_name_Smith = cur.fetchall()
    
    return pd.DataFrame(last_name_Smith)

In [ ]:
last_name_Smith(conn)

In [ ]:
#query to answer question 4 part 2
def name_Smith(conn):
    cur = conn.cursor()
    
    query = """SELECT COUNT(*)
               FROM Player 
               WHERE LOWER(player_name) LIKE '%smith%';"""
    cur.execute(query)
    name_Smith = cur.fetchall()
    
    return pd.DataFrame(name_Smith)

In [ ]:
name_Smith(conn)

#### 5. What was the median tie score? Use the value determined in the previous question for the number of tie games.

In [ ]:
#query to answer question 5
def ties_median(conn):
    cur = conn.cursor()
    
    query = """WITH total AS(
                    SELECT COUNT(*) AS total
                    FROM Match 
                    WHERE home_team_goal == away_team_goal),
                    top AS (
                    SELECT home_team_goal
                    FROM Match
                    WHERE home_team_goal == away_team_goal
                    ORDER BY home_team_goal ASC
                    LIMIT(SELECT total/2 from total)),
                    bottom AS (
                    SELECT home_team_goal
                    FROM Match
                    WHERE home_team_goal == away_team_goal
                    ORDER BY home_team_goal DESC
                    LIMIT(SELECT total/2 from total))
                    
                SELECT (MAX(top.home_team_goal) + MIN(bottom.home_team_goal))/2
                FROM top, bottom;"""
    cur.execute(query)
    ties_median = cur.fetchall()
    
    return pd.DataFrame(ties_median)

In [ ]:
ties_median(conn)

#### 6. What percentage of players prefer their left or right foot?

In [ ]:
table_columns(conn, "Player_Attributes")

In [ ]:
peek_at_table(conn, "Player_Attributes")

In [ ]:
#query to answer question 6
def pct_left(conn):
    cur = conn.cursor()
    
    query = """WITH left AS(   
                    SELECT COUNT(DISTINCT(player_api_id)) AS left
                    FROM Player_Attributes
                    WHERE preferred_foot == 'left')
               
               SELECT left.left * 100.0 /COUNT(DISTINCT(player_api_id))
               FROM left, Player_Attributes;"""
    cur.execute(query)
    pct_left = cur.fetchall()
    
    return pd.DataFrame(pct_left)

In [ ]:
pct_left(conn)

## Tennis sql exercises:

In [33]:
from sqlalchemy import create_engine
from sqlalchemy.orm import scoped_session, sessionmaker
import pandas as pd

engine = create_engine('postgresql://sarazzzz:localhost@localhost:5432/tennis')

In [ ]:
aus_men = pd.read_csv('./tennis/AusOpen-men-2013.csv')

#name this table "aus_men"
aus_men.to_sql('aus_men', engine, index=False)

In [ ]:
tennis_comp = ["AusOpen-women-2013", "FrenchOpen-men-2013", "FrenchOpen-women-2013", "USOpen-men-2013",
              "USOpen-women-2013", "Wimbledon-men-2013", "Wimbledon-women-2013"]
names = ["aus_women", "french_men", "french_women", 
         "us_men", "us_women", "gb_men", "gb_women"]
strings = ["aus_women", "french_men", "french_women", 
         "us_men", "us_women", "gb_men", "gb_women"]

for i in range(len(tennis_comp)):
    names[i] = pd.read_csv(f"./tennis/{tennis_comp[i]}.csv")
    
    names[i].to_sql(strings[i], engine, index=False)

In [106]:
query = 'SELECT * FROM us_men;'
df = pd.read_sql(query, engine)

df.head()

,Player1,Player2,Round,Result,FNL1,FNL2,FSP.1,FSW.1,SSP.1,SSW.1,...,BPC.2,BPW.2,NPA.2,NPW.2,TPW.2,ST1.2,ST2.2,ST3.2,ST4.2,ST5.2
0,Richard Gasquet,Michael Russell,1,1,3,0,63,45,37,16,...,1,3,30.0,40.0,83,3,4,2.0,NaN,NaN
1,Stephane Robert,Albano Olivetti,1,1,3,0,61,44,39,19,...,0,1,NaN,NaN,71,3,3,4.0,NaN,NaN
2,Jan-Lennard Struff,Guillaume Rufin,1,0,2,3,55,61,45,32,...,5,15,NaN,NaN,149,7,6,2.0,2.0,6.0
3,Aljaz Bedene,Dmitry Tursunov,1,0,1,3,52,41,48,19,...,6,9,NaN,NaN,121,7,4,6.0,6.0,NaN
4,Feliciano Lopez,Florent Serra,1,1,3,1,58,54,42,30,...,0,3,NaN,NaN,123,7,2,3.0,3.0,NaN

In [107]:
df.columns

Index(['Player1', 'Player2', 'Round', 'Result', 'FNL1', 'FNL2', 'FSP.1',
       'FSW.1', 'SSP.1', 'SSW.1', 'ACE.1', 'DBF.1', 'WNR.1', 'UFE.1', 'BPC.1',
       'BPW.1', 'NPA.1', 'NPW.1', 'TPW.1', 'ST1.1', 'ST2.1', 'ST3.1', 'ST4.1',
       'ST5.1', 'FSP.2', 'FSW.2', 'SSP.2', 'SSW.2', 'ACE.2', 'DBF.2', 'WNR.2',
       'UFE.2', 'BPC.2', 'BPW.2', 'NPA.2', 'NPW.2', 'TPW.2', 'ST1.2', 'ST2.2',
       'ST3.2', 'ST4.2', 'ST5.2'],
      dtype='object')

#### 1. Using the same tennis data, find the number of matches played by each player in each tournament. (Remember that a player can be present as both player1 or player2).

In [47]:
#query to answer question 1
query = """CREATE VIEW us_women_total AS(
           SELECT player1."Player 1" AS player, 
                  (player1."num_game1" + player2."num_game2") AS total,
                  'US_women' AS tournament
           FROM(SELECT us_women."Player 1", COUNT(*) AS num_game1
                FROM us_women
                GROUP BY us_women."Player 1") AS player1, 
               (SELECT us_women."Player 2", COUNT(*) AS num_game2
                FROM us_women
                GROUP BY us_women."Player 2") AS player2
           WHERE player1."Player 1" = player2."Player 2");"""

db = scoped_session(sessionmaker(bind = engine))
db.execute(query)
db.commit()

In [48]:
query = """CREATE VIEW us_men_total AS(
           SELECT player1."Player1" AS player, 
                  (player1."num_game1" + player2."num_game2") AS total,
                  'US_men' AS tournament
           FROM(SELECT us_men."Player1", COUNT(*) AS num_game1
                FROM us_men
                GROUP BY us_men."Player1") AS player1, 
               (SELECT us_men."Player2", COUNT(*) AS num_game2
                FROM us_men
                GROUP BY us_men."Player2") AS player2
           WHERE player1."Player1" = player2."Player2");"""

db = scoped_session(sessionmaker(bind = engine))
db.execute(query)
db.commit()

In [50]:
query = """SELECT * FROM aus_men_total
           UNION ALL
           SELECT * FROM french_men_total
           UNION ALL
           SELECT * FROM gb_men_total
           UNION ALL
           SELECT * FROM us_men_total
           UNION ALL
           SELECT * FROM aus_women_total
           UNION ALL
           SELECT * FROM french_women_total
           UNION ALL
           SELECT * FROM gb_women_total
           UNION ALL
           SELECT * FROM us_women_total;"""

df = pd.read_sql(query, engine)
df.head()

             player  total tournament
0  Adrian Mannarino      2    Aus_men
1     Tommy Robredo      4    Aus_men
2     Pablo Andujar      2    Aus_men
3   Thomaz Bellucci      2    Aus_men
4      Donald Young      3    Aus_men

#### 2. Who has played the most matches total in all of US Open, AUST Open, French Open? Answer this both for men and women.

In [54]:
query = """SELECT master_men."player", SUM(master_men."total") AS grand_total
           FROM(SELECT * FROM aus_men_total
                UNION ALL
                SELECT * FROM french_men_total
                UNION ALL
                SELECT * FROM us_men_total) AS master_men
            GROUP BY master_men."player"
            ORDER BY grand_total DESC
            LIMIT(1);"""
pd.read_sql(query, engine)

               player  grand_total
0  Stanislas Wawrinka         17.0

In [55]:
query = """SELECT master_women."player", SUM(master_women."total") AS grand_total
           FROM(SELECT * FROM aus_women_total
                UNION ALL
                SELECT * FROM french_women_total
                UNION ALL
                SELECT * FROM us_women_total) AS master_women
            GROUP BY master_women."player"
            ORDER BY grand_total DESC
            LIMIT(1);"""
pd.read_sql(query, engine)

               player  grand_total
0  Dominika Cibulkova          7.0

#### 3. Who has the highest first serve percentage? (Just the maximum value in a single match.)

In [63]:
query = """CREATE VIEW us_fsp AS(
           SELECT us_men."Player1" AS player, us_men."FSP.1" AS fsp FROM us_men
           UNION ALL
           SELECT us_men."Player2" AS player, us_men."FSP.2" AS fsp FROM us_men
           UNION ALL
           SELECT us_women."Player 1" AS player, us_women."FSP.1" AS fsp FROM us_women
           UNION ALL
           SELECT us_women."Player 2" AS player, us_women."FSP.2" AS fsp FROM us_women);"""
db = scoped_session(sessionmaker(bind = engine))
db.execute(query)
db.commit()

In [65]:
query = """SELECT * FROM aus_fsp
           UNION ALL
           SELECT * FROM french_fsp
           UNION ALL
           SELECT * FROM gb_fsp
           UNION ALL
           SELECT * FROM us_fsp
           ORDER BY fsp DESC
           LIMIT(1);"""
pd.read_sql(query, engine)

     player  fsp
0  S Errani   93

#### 4. What are the unforced error percentages of the top three players with the most wins? (Unforced error percentage is % of points lost due to unforced errors. In a match, you have fields for number of points won by each player, and number of unforced errors for each field.)

In [108]:
query = """CREATE VIEW us_pct_ufe AS(
           SELECT us_men."Player1" AS player, us_men."DBF.1" AS dbf, 
                  us_men."UFE.1" AS ufe, us_men."FNL1" AS games_won FROM us_men
           UNION ALL
           SELECT us_men."Player2" AS player, us_men."DBF.2" AS dbf,
                  us_men."UFE.2" AS ufe, us_men."FNL2" AS games_won FROM us_men
           UNION ALL
           SELECT us_women."Player 1" AS player, us_women."DBF.1" AS dbf, 
                  us_women."UFE.1" AS ufe, us_women."FNL.1" AS games_won FROM us_women
           UNION ALL
           SELECT us_women."Player 2" AS player, us_women."DBF.2" AS dbf,
                  us_women."UFE.2" AS ufe, us_women."FNL.2" AS games_won FROM us_women);"""
db = scoped_session(sessionmaker(bind = engine))
db.execute(query)
db.commit()

In [110]:
query = """SELECT master."player", SUM(master."dbf") AS dbf_player, SUM(master."ufe") AS ufe_player, 
                  SUM(master."ufe")*100.0/(SUM(master."dbf") + SUM(master."ufe")) AS pct_ufe, 
                  SUM(games_won) AS num_win
           FROM(SELECT * FROM aus_pct_ufe
                UNION ALL
                SELECT * FROM french_pct_ufe
                UNION ALL
                SELECT * FROM gb_pct_ufe
                UNION ALL
                SELECT * FROM us_pct_ufe) AS master
            GROUP BY master."player"
            ORDER BY SUM(games_won) DESC
            LIMIT(5);"""
pd.read_sql(query, engine)

               player  dbf_player  ufe_player    pct_ufe  num_win
0       Polona Hercog         NaN         1.0        NaN      NaN
1        Rafael Nadal        35.0       380.0  91.566265     59.0
2      Novak Djokovic        26.0       366.0  93.367347     47.0
3  Stanislas Wawrinka        69.0       459.0  86.931818     46.0
4        David Ferrer        49.0       349.0  87.688442     45.0

In [ ]:
#close the session
db.close()